src/main/resources/ServiceData/ValidateEmployeeService/ValidateEmployeeRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://xmlns.officedepot.com/ApplicationMessage/HR/Custom/ABM/ValidateEmployeeRequestABM/V1" xmlns:tran="http://www.officedepot.com/model/transaction" xmlns:v11="http://xmlns.officedepot.com/ApplicationMessage/HR/Custom/ABM/ValidateEmployeeRequestABO/V1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:ValidateEmployeeRequestABM>
         <tran:transactionHeader>
            <tran:consumer>
               <tran:consumerName>$CONSUMER_NAME</tran:consumerName>
               <!--Optional:-->
               <tran:consumerTransactionID>$CONSUMER_TRANSACTION_ID</tran:consumerTransactionID>
            </tran:consumer>
         </tran:transactionHeader>
         <v1:ValidateEmployeeRequest>
            <v11:ODEmployeeID>$EMPLOYEE_ID</v11:ODEmployeeID>
            <!--Optional:-->
         </v1:ValidateEmployeeRequest>
      </v1:ValidateEmployeeRequestABM>
   </soapenv:Body>
</soapenv:Envelope>